GitConverter/src/Catalogs/ВерсииХранилища/ВерсииХранилища.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВерсииХранилища</name>
  <owners>Catalog.ХранилищаКонфигураций</owners>
  <attributes>
    <name>Автор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВерсияКонфигурации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВозниклаОшибка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыгруженыТолькоИзменения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаОбработки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Источник</name>
    <type>
      <types>CatalogRef.ХранилищаКонфигураций</types>
      <types>CatalogRef.ОчередиВыполнения</types>
      <types>CatalogRef.КопииХранилищКонфигурации</types>
    </type>
  </attributes>
  <attributes>
    <name>КаталогВременныхФайлов</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>512</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоМетаданных</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоОшибок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Состояние</name>
    <type>
      <types>EnumRef.СостоянияВерсии</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстОшибки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетсяПолнаяВыгрузка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Хеш</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Состав</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбъектМетаданных</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

GitConverter/src/InformationRegisters/СостоянияВерсий/СостоянияВерсий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СостоянияВерсий</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Состояние</name>
    <type>
      <types>EnumRef.СостоянияВерсии</types>
    </type>
  </resources>
  <resources>
    <name>НомерСеанса</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>11</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НачалоСеанса</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <dimensions>
    <name>ВерсияХранилища</name>
    <type>
      <types>CatalogRef.ВерсииХранилища</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

GitConverter/src/Enums/СостоянияВерсии/СостоянияВерсии.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостоянияВерсии</name>
  <enumValues>
    <name>ПолучаетсяCF</name>
  </enumValues>
  <enumValues>
    <name>ПолученCF</name>
  </enumValues>
  <enumValues>
    <name>ВыгружаетсяВXML</name>
  </enumValues>
  <enumValues>
    <name>ВыгруженаВXML</name>
  </enumValues>
  <enumValues>
    <name>ЗагружаетсяВEDT</name>
  </enumValues>
  <enumValues>
    <name>ЗагруженаВEDT</name>
  </enumValues>
  <enumValues>
    <name>ПомещаетсяВGit</name>
  </enumValues>
  <enumValues>
    <name>ПомещенаВGit</name>
  </enumValues>
</mdclass:Enum>

GitConverter/src/Catalogs/ВерсииХранилища/ObjectModule.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2017-2018, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution-ShareAlike 4.0 International (CC BY-SA 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by-sa/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Если ЗначениеЗаполнено(Состояние) Тогда
		ЭтоНачалоОперации = (Перечисления.СостоянияВерсии.СостоянияПриНачалеОпераций().Найти(Состояние) <> Неопределено);
		Если ВозниклаОшибка И Не ЭтоНачалоОперации Тогда
			Текст = СтрШаблон(НСтр("ru = 'При включенном флажке ""Возникла ошибка"" у версии не может быть состояние %1.'"), Состояние);
			ОбщегоНазначения.СообщитьОбОшибкеВОбъекте(Отказ, ЭтотОбъект, Текст, "Состояние");
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	Если ОбменДанными.Загрузка Или Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ЗначенияРеквизитовДоЗаписи = ЗначенияРеквизитовДоЗаписи();
	ЭтоНачалоОперации = (Перечисления.СостоянияВерсии.СостоянияПриНачалеОпераций().Найти(Состояние) <> Неопределено);
	
	Если Не ОбщегоНазначения.КаталогСуществует(КаталогВременныхФайлов) Тогда
		КаталогВременныхФайлов = "";
	ИначеЕсли Не ЭтоНовый() Тогда
		Справочники.ВерсииХранилища.ПередЗаписьюВерсииОчиститьКаталогПриНеобходимости(ЭтотОбъект);
	КонецЕсли;
	
	// При очистке состояния также очищаются и другие реквизиты.
	Если Не ЗначениеЗаполнено(Состояние) Тогда
		КоличествоМетаданных = 0;
		Источник = Неопределено;
		ВозниклаОшибка = Ложь;
	КонецЕсли;
	
	// Каталог временных файлов должен быть заполнен в тот момент, когда версия поступает в обработку.
	Если Не ВозниклаОшибка И ЭтоНачалоОперации И Не ЗначениеЗаполнено(КаталогВременныхФайлов) Тогда
		ЗаполнитьКаталогВременныхФайлов();
	КонецЕсли;
	
	ЗаполнитьДатуНачалаОбработки = (ВозниклаОшибка Или ЭтоНачалоОперации);
	Если ЗаполнитьДатуНачалаОбработки <> ЗначениеЗаполнено(ДатаНачалаОбработки) Тогда
		Если ЗаполнитьДатуНачалаОбработки Тогда
			ДатаНачалаОбработки = ТекущаяДата();
		Иначе
			ДатаНачалаОбработки = '00010101';
		КонецЕсли;
	КонецЕсли;
	
	Если Состояние <> Перечисления.СостоянияВерсии.ПомещенаВGit Тогда
		Хеш = "";
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Состояние)
		Или Состояние = Перечисления.СостоянияВерсии.ПолучаетсяCF
		Или Состояние = Перечисления.СостоянияВерсии.ПолученCF Тогда
		ВыгруженыТолькоИзменения = Ложь;
	КонецЕсли;
	
	Комментарий = СокрЛП(Комментарий);
	Если Комментарий <> "" Тогда
		ЗаполнитьАвтораКоммита();
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	Если ОбменДанными.Загрузка Или Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ЗначенияРеквизитовДоЗаписи = ЗначенияРеквизитовДоЗаписи();
	
	Если ЗначенияРеквизитовДоЗаписи.ЭтоНовый Или Состояние <> ЗначенияРеквизитовДоЗаписи.Состояние Тогда
		ТекущаяДатаСеанса = ТекущаяДатаСеанса();
		
		НаборЗаписей = РегистрыСведений.СостоянияВерсий.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ВерсияХранилища.Установить(Ссылка);
		НаборЗаписей.Отбор.Период.Установить(ТекущаяДатаСеанса);
		
		Сеанс = ПолучитьТекущийСеансИнформационнойБазы();
		
		Запись = НаборЗаписей.Добавить();
		Запись.Период = ТекущаяДатаСеанса;
		Запись.ВерсияХранилища = Ссылка;
		Запись.Состояние = Состояние;
		Запись.НомерСеанса = Сеанс.НомерСеанса;
		Запись.НачалоСеанса = Сеанс.НачалоСеанса;
		
		НаборЗаписей.Записать();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция ЗначенияРеквизитовДоЗаписи(ЧитатьИзСУБД = Неопределено) Экспорт
	Результат = Неопределено;
	Если ДополнительныеСвойства.Свойство("ЗначенияРеквизитовДоЗаписи", Результат) Тогда
		Возврат Результат;
	КонецЕсли;
	
	ЭтоНовый = ЭтоНовый();
	Если ЧитатьИзСУБД = Неопределено Тогда
		ЧитатьИзСУБД = Не ЭтоНовый;
	КонецЕсли;
	
	ИменаРеквизитов = "Состояние, ВозниклаОшибка, Комментарий";
	Если ЧитатьИзСУБД Тогда
		Результат = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка, ИменаРеквизитов);
	Иначе
		Результат = ОбщегоНазначения.ЗначенияСвойств(ЭтотОбъект, ИменаРеквизитов);
	КонецЕсли;
	Результат.Вставить("ЭтоНовый", ЭтоНовый);
	
	ДополнительныеСвойства.Вставить("ЗначенияРеквизитовДоЗаписи", Результат);
	Возврат Результат;
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьКаталогВременныхФайлов()
	
	КаталогВыгрузкиВерсий = "";
	Если ЗначениеЗаполнено(Источник) Тогда
		КаталогВыгрузкиВерсий = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Источник, "КаталогВыгрузкиВерсий");
	КонецЕсли;
	Если Не ЗначениеЗаполнено(КаталогВыгрузкиВерсий) Тогда
		КаталогВыгрузкиВерсий = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Владелец, "КаталогВыгрузкиВерсий");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(КаталогВыгрузкиВерсий) Тогда
		КаталогВременныхФайлов = ОбщегоНазначения.ПолноеИмяКаталога(КаталогВыгрузкиВерсий, Истина, Ложь)
			+ Формат(Код, "ЧДЦ=0; ЧН=; ЧГ=") + ПолучитьРазделительПути();
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьАвтораКоммита()
	
	СтандартнаяОбработка = Истина;
	КонвертацияХранилищаПереопределяемый.ПриОпределенииАвтораКоммита(ЭтотОбъект, СтандартнаяОбработка);
	Если Не СтандартнаяОбработка Тогда
		Возврат;
	КонецЕсли;
	
	ПерваяСтрока = СтрПолучитьСтроку(Комментарий, 1);
	Массив = СтрРазделить(ПерваяСтрока, ":", Истина);
	Если Массив.Количество() < 2 Тогда
		Возврат;
	КонецЕсли;
	ПредполагаемыйАвтор = Массив[0];
	
	Если СтрНайти(ПредполагаемыйАвтор, " ") > 0 Или СтрСравнить(Пользователь, ПредполагаемыйАвтор) = 0 Тогда
		Возврат; // Не имя пользователя, либо имя автора совпадает с именем коммиттера.
	КонецЕсли;
	Информация = КонвертацияХранилищаПовтИсп.ИнформацияОПользователе(Владелец, ПредполагаемыйАвтор);
	Если СтрНайти(Информация.EMail, "@") = 0 Тогда
		Возврат; // Не электронная почта.
	КонецЕсли;
	
	Автор = ПредполагаемыйАвтор;
	
КонецПроцедуры


#КонецОбласти

#КонецЕсли
